Revit 2026 API

# CompoundStructureLayerWidth Property

---

Width of the layer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Width { get; set; }
```
```vb
Public Property Width As Double
	Get
	Set
```
```cpp
public:
property double Width {
	double get ();
	void set (double value);
}
```
```fsharp
member Width : float with get, set
```

#### Property Value

Double

Can be 0.0 if this is a membrane layer. 0.0 is the default.

#### Reference

CompoundStructureLayer Class

Autodesk.Revit.DB Namespace